Funsies/app/controllers/articles_controller.rb

	def index
		@a = Article.where(id: rand(1...Article.count+1))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]

	def create

		@article = Article.create( article_params )
---
INSERT INTO "articles" ("created_at", "updated_at", "website") VALUES (?, ?, ?)  [["created_at", "2017-10-12 18:58:43.846389"], ["updated_at", "2017-10-12 18:58:43.846389"], ["website", "https://www.w3schools.com/html/html_youtube.asp"]]