Networks/SeeMyProblem/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "post_type") VALUES (?, ?, ?, ?, ?)  [["title", "Post type"], ["content", "testing"], ["created_at", "2017-09-25 21:45:14.073070"], ["updated_at", "2017-09-25 21:45:14.073070"], ["post_type", "Other"]]
---
  def create

    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "post_type" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Stack sause"], ["content", "Nugger"], ["post_type", "2nd"], ["updated_at", "2017-09-27 18:31:07.739866"], ["id", 16]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)