NotebookProjects/my_ajax/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Turtlw"], ["content", "Looks like something"], ["created_at", "2017-07-21 23:28:52.382132"], ["updated_at", "2017-07-21 23:28:52.382132"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])