Networks/EmotionalSupport/app/views/posts/_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 11]]
---
</tr>
<% post.comments.each do |comment| %>