NotebookProjects/Problem_Network/app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "body", "header", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["body", "This is the first post"], ["header", "First"], ["created_at", "2017-07-23 04:18:39.260145"], ["updated_at", "2017-07-23 04:18:39.260145"]]
---
  def create
    binding.pry
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save