NotebookProjects/Problem_Network/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "chve38@gmail.com"], ["password", "Gold"], ["country", "USA"], ["created_at", "2017-07-23 04:18:16.402055"], ["updated_at", "2017-07-23 04:18:16.402055"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save