Voix_0/Voix/app/controllers/comments_controller.rb

  def create

    ## Might need to add something here to handle when the commment is added to post
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.post_id = params[:post_id]

      if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "c_audio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)