Voix_0/Voix/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.includes(:comments)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29)
SELECT "posts".* FROM "posts"

  def create

    @post = Post.new(post_params)
    @post.user_id = current_user.id

    ##maybe need to add something here to handle the comments

      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post 1"], ["body", "Body 1"], ["created_at", "2017-10-03 21:11:43.285318"], ["updated_at", "2017-10-03 21:11:43.285318"]]