Networks/EmotionalSupport/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "comme"], ["post_id", 1], ["user_id", 1], ["created_at", "2017-09-26 19:03:47.522029"], ["updated_at", "2017-09-26 19:03:47.522029"]]
---
	def create
		binding.pry
		@comment = @post.comments.create(params[:comment].permit(:content))

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Yaaaaay!!!!"], ["updated_at", "2017-09-26 19:32:51.110921"], ["id", 4]]
---
	def update
		if @comment.update(params[:comment].permit(:content))

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 4], ["LIMIT", 1]]
---
	def find_comment
		@comment = @post.comments.find(params[:id])