Networks/EmotionalSupport/app/controllers/posts_controller.rb

  def show
    @comments = Comment.where(post_id: @post).order("created_at DESC")
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
   # @post.id = Post.all.count + 1
   binding.pry
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Hello"], ["content", "Me"], ["created_at", "2017-09-28 16:29:08.426218"], ["updated_at", "2017-09-28 16:29:08.426218"], ["user_id", 1]]